turbinesFoam/tests/bladeSurface/system/fvOptions.surface
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Surface-enabled variant of system/fvOptions: the same standalone cylinder
// element with `surfaceGeometry` configured. The source injects
// `projectElementForce false` into the element, and the distributor spreads
// the element force over the two plate nodes (cosine kernel, paper Eq. 8).
// The construction frame is supplied explicitly because no turbine source
// injects it: canonical +x = chord x span (plate normal), +y = chord
// (trailing -> leading), +z = outward span.

blade
{
    type            actuatorLineSource;
    active          true;

    actuatorLineSourceCoeffs
    {
        fieldNames          (U);
        selectionMode       cellSet;
        cellSet             bladeCells;

        freeStreamVelocity  (1 0 0);
        nElements           1;
        writePerf           true;
        writeElementPerf    true;
        endEffects          false;

        elementGeometry // (point spanDir chordLength chordRefDir chordMount pitch)
        (
            ((0.5 0.5 0.4) (0 0 1) (0.2) (0 1 0) (0.5) (0))
            ((0.5 0.5 0.6) (0 0 1) (0.2) (0 1 0) (0.5) (0))
        );

        elementProfiles (cylinder);

        // Blade surface distributor (D1-D9)
        surfaceGeometry     "geometry/plate.stl";
        surfaceOrigin       (0 0 0);
        surfaceSpanDirection (0 0 1);
        surfaceChordDirection (0 1 0);
        kernel              cosine;
        rho                 1.0;
        writeNodePerf       true;

        profileData
        {
            cylinder
            {
                // Constant drag coefficient: the element force is analytic
                data
                (
                    (-180 0 1.1)
                    (180 0 1.1)
                );
            }
        }
    }
}

// ************************************************************************* //
